Repository: pypi-data/pypi-mirror-144
Catalog: packages/votebase/votebase-0.5.0.tar.gz/votebase-0.5.0/votebase/locale/*/LC_MESSAGES/django.po
Languages: hu, pl

source: quiz
hu: kvíz

source: Yes
hu: Igen
pl: Tak

source: No
hu: Nem
pl: Nie

source: Select an option
hu: Válassz a lehetőségek közül
pl: Wybierz jedną z możliwości

source: Public - for everyone
hu: Nyilvános - mindenki számára
pl: Publiczne - dostępne dla wszystkich

source: Registered users only
hu: Csak regisztrált felhasználok számára
pl: Wyłącznie dla zarejestrowanych użytkowników

source: Secret - for voters only
hu: Titkos - csak szavazók számára
pl: Tajne - wyłącznie dla uczestników

source: Private - for creator only
hu: Privát - csak szerző számára
pl: Prywatne - wyłącznie dla twórcy

source: title
hu: cím
pl: tytuł

source: hash key
hu: kettős kereszt jel
pl: klucz hash

source: tag
hu: címke

source: preface
hu: előszó
pl: przedmowa

source: postface
hu: zárszó
pl: posłowie

source: valid from
hu: érvényes innentől
pl: właściwa forma

source: Users can start voting beginning this date.
hu: A felhasználók ettől az időponttól kezdve szavazhatnak.
pl: Użytkownicy mogą rozpocząć głosowanie od tej daty.

source: valid to
hu: érvényes eddig
pl: ważne do

source: Users will be able to vote until this date. Keep blank to unlimited.
hu: A felhasználók eddig az időpontig szavazhatnak. Hagyja üresen, ha korlátlan ideig szavazhatnak.
pl: Użytkownicy mogą głosować do tej daty. Pozostaw pole puste, by czas był nieograniczony.

source: time limit
hu: időkorlát
pl: limit czasu

source: In minutes. Keep blank to infinite.
hu: A művelet eltarthat néhány percig. Kérlek ne hagyd el az oldalt.
pl: W minutach. Brak wartości oznacza nieskończoność

source: password
hu: jelszó
pl: hasło

source: permission level
hu: engedélyezési szint
pl: poziom uprawnień

source: statistics policy
hu: statisztikai irányelv
pl: polityka statystyk

source: active
hu: aktív
pl: aktywny

source: Current survey status. Users will not be able to start voting if inactive.
hu: A kérdőív jelenlegi állapota. A felhasználók nem szavazhatnak ha inaktív.
pl: Bieżący status ankiety. Użytkownicy nie będą mogli rozpocząć głosowania jeśli jest ona nieaktywna.

source: repeatable voting
hu: ismételhető szavazás
pl: powtarzalne głosowanie

source: Set checked if users can vote multiple times in survey.
hu: Jelölje be, ha a felhasználók többször is szavazhatnak a kérdőívben.
pl: Zaznacz, jeśli użytkownicy mogą uczestniczyć w ankiecie wielokrotnie.

source: show quiz results
hu: mutasd a kvíz eredményeket
pl: pokaż wyniki quizu

source: Set checked if you want to show quiz results in percentage to voters.
hu: Jelölje be, ha szeretné a kvíz eredményét százalékokban megmutatni a szavazóknak.
pl: Zaznacz jeśli chcesz wyświetlać procentowe wyniki testu uczestnikom.

source: show quiz correct options
hu: mutasd a kvíz helyes válaszait
pl: pokaż właściwe opcje quizu

source: Set checked if you want to show correct options to voters.
hu: Jelölje be, ha szeretné a kvíz helyes lehetőségeit megmutatni a szavazóknak.
pl: Zaznacz, jeśli chcesz, aby uczestnicy widzieli poprawne wybory.

source: published
hu: közzétéve
pl: opublikowano

source: Set checked if users can see survey.
hu: Jelölje be, ha szeretné, hogy a felmérés megjelenjen a felhasználók számára.
pl: Zaznacz, jeśli użytkownicy mogą wyświetlać ankietę

source: created
hu: létrehozott
pl: utworzono

source: modified
hu: módosított
pl: zmodyfikowano

source: survey
hu: felmérés
pl: ankieta

source: surveys
hu: felmérések
pl: ankiety

source: Checkbox
hu: Jelölőnégyzet
pl: Pole wyboru

source: Dropdown
hu: Legördülő
pl: Lista rozwijana

source: Textfield
hu: Szövegterület
pl: Pole tekstowe (jednoliniowe)

source: Textarea
hu: Szövegterület
pl: Textarea (obszar tekstowy)

source: kind
hu: fajta
pl: typ

source: category
hu: kategória
pl: kategoria

source: weight
hu: súly
pl: waga

source: mandatory
hu: kötelező
pl: obowiązkowe

source: unique answers
hu: egyedi válaszok
pl: unikalne odpowiedzi

source: for matrix questions
hu: mátrix kérdésekhez
pl: do pytań macierzowych

source: enabled empty rows
hu: üres sorok engedélyezve
pl: puste wiersze dozwolone

source: for matrix questions with required answer
hu: mátrix kérdésekhez kötelező válaszokkal
pl: do pytań macierzowych wymagających odpowiedzi

source: question
hu: kérdés
pl: pytanie

source: questions
hu: kérdések
pl: pytania

source: Row
hu: Sor
pl: Wiersz

source: Column
hu: Oszlop
pl: Kolumna

source: orientation
hu: orientáció
pl: orientacja

source: correct
hu: helyes
pl: poprawne

source: option
hu: lehetőség
pl: opcja

source: options
hu: lehetőségek
pl: opcje

source: History
hu: Előzmények
pl: Historia

source: Vote
hu: Szavazás
pl: Głosuj

source: Preview
hu: Előnézet
pl: Podgląd

source: Infographics
hu: Infografika
pl: Infografika

source: Statistics
hu: Statisztika
pl: Statystyki

# url
source: preview/<str:slug>/
hu: elonezet/<str:slug>/
pl: podglad/<str:slug>/

source: Count
hu: Számlálás
pl: Liczba

source: Total count
hu: Teljes számlálás
pl: Łączna liczba

source: Duration
hu: Időtartam
pl: Czas trwania

source: Quiz result
hu: Kvíz eredmény
pl: Wyniki testu

source: Age
hu: Kor
pl: Wiek

source: Wrong answer (0%)
hu: Helytelen válasz (0%)
pl: Błędna odpowiedź (0%)

source: Correct answer (100%)
hu: Helyes válasz (100%)
pl: Poprawna odpowiedź (100%)

source: Partially correct answer (%s%%)
hu: Részlegesen helyes válasz (%s%%)
pl: Częściowo poprawna odpowiedź (%s%%)

source: Very bad!
hu: Nagyon rossz!
pl: Bardzo źle!

source: Try harder next time!
hu: Próbálkozz jobban legközelebb!
pl: Postaraj się jeszcze bardziej następnym razem!

source: Well, it could be better!
hu: Hát, lehetne jobb is!
pl: Cóż, mogło być lepiej!

source: Pretty good!
hu: Elég jó!
pl: Całkiem nieźle!

source: Great!
hu: Remek!
pl: Świetnie!

source: Perfect!
hu: Kiváló!
pl: Doskonale!

source: STORED RESULT
hu: MENTETT EREDMÉNY
pl: ZAPISANY WYNIK

source: CALCULATED RESULT
hu: KISZÁMÍTOTT EREDMÉNY
pl: OBLICZONE WYNIKI

source: These results are different because the survey creator changed the correct options for the quiz questions. Please contact them.
hu: Az eredmények különböznek, mivel a felmérés szerzője megváltoztatta a helyes választ. Lépj vele kapcsolatba.
pl: Wyniki te się różnią, ponieważ twórca ankiety zmienił poprawne odpowiedzi pytań. Skontaktuj się z tą osobą.

# url
source: answers/
hu: valaszok/
pl: odpowiedzi/

# url
source: infographics/
hu: Infografika/
pl: infografika/

source: Male
hu: Férfi
pl: Mężczyzna

source: Female
hu: Nő
pl: Kobieta

source: Unknown
hu: Ismeretlen
pl: Nieznane

source: All rows are required.
hu: Minden sor szükséges.
pl: Wszystkie wiersze są wymagane.

source: Values have to be unique.
hu: Az értékeknek egyedinek kell lenniük.
pl: Wartości muszą być unikalne.

source: You have not confirmed your email address yet. If you did not receive confirmation, please click <a href="%(url)s">here</a>.
hu: Még nem erősítetted meg az e-mail címedet. Ha nem érkezett meg a megerősítő e-mail, kérlek kattints ide: <a href="%(url)s"></a>.
pl: Nie potwierdziłeś/aś wciąż swojego adresu email. Jeśli nie otrzymałeś/aś nadal linku weryfikacyjnego, kliknij proszę <a href="%(url)s">tutaj </a>

source: New voter in your survey
hu: Új szavazó a felmérésedben
pl: Nowy uczestnik w Twojej ankiecie

source: You have one new voter in your survey %(survey)s
hu: Új szavazó van a %(survey)s felmérésedben
pl: Masz jednego nowego głosującego w Twojej ankiecie %(survey)s

source: You have one new voter in your survey <a href="%(url)s">%(survey)s</a>
hu: Új szavazó van a felmérésedben <a href="%(url)s">%(survey)s</a>
pl: Masz jednego nowego głosującego w Twojej ankiecie <a href="%(url)s">%(survey)s

source: New voters in your survey
hu: Új szavazók a felmérésedben
pl: Nowi uczestnicy w Twojej ankiecie

source: You have %(voters_count)d new voters in your survey %(survey)s
hu: %(voters_count)d új szavazó a van felmérésedben %(survey)s
pl: Masz %(voters_count)d nowych głosujących w Twojej ankiecie %(survey)s

source: You have %(voters_count)d new voters in your survey <a href="%(url)s">%(survey)s</a>
hu: %(voters_count)d új szavazó van a felmérésedben<a href="%(url)s">%(survey)s</a>
pl: Masz %(voters_count)d nowych głosujących w Twojej ankiecie <a href="%(url)s">%(survey)s</a>

source: Your quiz result in survey
hu: A kvíz eredményed a felmérésben
pl: Twój wynik testu w ankiecie

source: Your results are also available here:
hu: Az eredményeid itt is megtalálhatóak:
pl: Twoje wyniki są również dostępne tutaj:

source: quiz result sent
hu: kvíz eredmény elküldve
pl: wysłano wyniki quizu

# url
source: vote/
hu: szavaz/
pl: glosuj/

source: Voter and request user mismatch
hu: Hiba
pl: Niezgodność głosującego i wywołanego użytkownika

source: Time expired
hu: Lejárt az idő
pl: Dostępny czas upłynął

source: Voter and question survey mismatch
hu: Hiba
pl: Niezgodność uczestnika i ankiety

source: Answers not saved because form is not valid
hu: A válaszok nincsenek elmentve, mert az űrlap nem érvényes
pl: Odpowiedzi nie zostały zapisane, ponieważ formularz zawiera błędy

source: Answers couldn't be saved
hu: A válaszokat nem tudtuk menteni
pl: Odpowiedzi nie mogły zostać zapisane

source: Answers saved
hu: A válaszok elmentve
pl: Odpowiedzi zapisane

source: Password
hu: Jelszó
pl: Hasło

source: Password is incorrect!
hu: A jelszó helytelen!
pl: Hasło jest niepoprawne!

source: user
hu: felhasználó
pl: użytkownik

source: language
hu: nyelv
pl: język

source: quiz result
hu: kvíz eredmény
pl: wyniki quizu

source: IP address
hu: IP cím
pl: Adres IP

source: voting started
hu: a szavazás megkezdődött
pl: głosowanie rozpoczęte

source: voting ended
hu: a szavazás véget ért
pl: głosowanie zakończone

source: voting duration
hu: a szavazás hossza
pl: czas głosowania

source: custom flag
hu: egyedi zászló
pl: własna flaga

source: API voter
hu: API szavazó

source: irrelevant
hu: lényegtelen
pl: nieistotne

source: respondent
hu: válaszadó

source: respondents
hu: válaszadók
pl: respondenci

source: voter
hu: szavazó
pl: respondent

source: page
hu: oldal
pl: strona

source: voted question
hu: bejelölt kérdés
pl: na pytanie odpowiedziano

source: voted questions
hu: bejelölt kérdések
pl: na pytania odpowiedziano

source: custom
hu: egyedi
pl: własne

source: option column
hu: oszlop opció
pl: kolumna opcji

source: answer
hu: válasz
pl: odpowiedź

source: answers
hu: válaszok
pl: odpowiedzi

source: You have already voted in this survey.
hu: Már szavaztál ebben a felmérésben.
pl: Głosowałeś/aś już w tej ankiecie.

source: Your results are available here:
hu: Az eredményeid itt találhatóak:
pl: Twoje wyniki są dostępne tutaj:

source: Continue to
hu: Folytassa erre
pl: Kontynuuj do

source: Your results will be available here:
hu: Az eredményeid itt fognak megjelenni:
pl: Twoje wyniki będą dostępne tutaj:

source: This survey is inactive right now.
hu: Ez a felmérés inaktív ebben a pillanatban.
pl: Ta ankieta jest obecnie nieaktywna.

source: Start
hu: Kezdés

source: This survey is only for registered users.
hu: Ez a felmérés csak regisztrált felhasználók számára érhető el.
pl: Ta ankieta jest dostępna wyłącznie dla zarejestrowanych użytkowników.

source: Log in
hu: Bejelentkezés
pl: Zaloguj się

source: or
hu: vagy
pl: lub

source: Register
hu: Regisztráció
pl: Zarejestruj się

source: This survey is password protected.
hu: Ez a felmérés jelszóval védett.
pl: Ta ankieta jest zabezpieczona hasłem.

source: Please, enter correct password.
hu: Kérem adja meg a helyes jelszót.
pl: Proszę podać prawidłowe hasło.

source: Submit
hu: Beküldés
pl: Prześlij

source: Voting time expired.
hu: A szavazásra rendelkezésre álló idő lejárt.
pl: Upłynął czas na głosowanie.

# url
source: finish/<str:slug>/
hu: befejezes/<str:slug>/
pl: zakoncz/<str:slug>/

# url
source: inactive/<str:slug>/
hu: inaktiv/<str:slug>/
pl: nieaktywny/<str:slug>/

# url
source: password/<str:slug>/
hu: jelszo/<str:slug>/
pl: haslo/<str:slug>/

# url
source: already-voted/<str:slug>/
hu: mar-szavazott/<str:slug>/
pl: juz-glosowano/<str:slug>/

# url
source: expired/<str:slug>/
hu: lejart/<str:slug>/
pl: wygasly/<str:slug>/

# url
source: only-for-registered/<str:slug>/
hu: csak-regisztralt-felhasznalok-szamara/<str:slug>/
pl: tylko-dla-zarejestrowanych/<str:slug>/

# url
source: respondent/<str:hash_key>/
hu: valaszado/<str:hash_key>/

source: Time expired and your answers have been saved automatically
hu: Lejárt az idő és a válaszaidat automatikusan mentettük
pl: Dostępny czas upłynął, a Twoje odpowiedzi zostały automatycznie zapisane

source: Your response has been successfully saved.
hu: A választ sikeresen mentettük.
pl: Twoja odpowiedź została pomyślnie zapisana.

source: Make sure that you have answered all required questions.
hu: Kérlek válaszolj az összes szükséges kérdésre.
pl: Upewnij się, że odpowiedziałeś/aś na wszystkie wymagane pytania.

source: Respondent didn't finished the survey yet
hu: A kitöltő még nem fejezte be a kérdőívet
pl: Uczestnik nie ukończył jeszcze ankiety

source: surveys/
hu: felmeresek/
pl: ankiety/

source: voting/
hu: szavazas/
pl: głosowanie/

source: statistics/
hu: statisztika/
pl: statystyki/

source: Radio
pl: Jedna odpowiedź

source: Matrix radio
pl: Macierz pól wyboru typu radio
